In [2]:
# support(x,y); x ve y nin birlikte görülme sıklığı / tüm işlemler
# yani x ve ye nin birlikte görülme olasılığı

#confidence(x,y) x alındığında y nin satılması olasılığı

#lift değeri x satın alındığında y nin satın alınma olasılığı lift kat kadar artar

In [3]:
import pandas as pd
from mlxtend.frequent_patterns import apriori, association_rules
df_ = pd.read_excel("online_retail_II.xlsx",sheet_name="Year 2010-2011")

In [4]:
df = df_.copy()
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [5]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
Price               0
Customer ID    135080
Country             0
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541910 entries, 0 to 541909
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      541910 non-null  object
 1   StockCode    541910 non-null  object
 2   Description  540456 non-null  object
 3   Quantity     541910 non-null  int64
 4   InvoiceDate  541910 non-null  datetime64[ns]
 5   Price        541910 non-null  float64
 6   Customer ID  406830 non-null  float64
 7   Country      541910 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [17]:
df["Invoice"].str.extract('([A-Za-z]+)')[0].isin(["C"]).sum()

9288

In [35]:
df["Invoice"]

0         536365
1         536365
2         536365
3         536365
4         536365
           ...
541905    581587
541906    581587
541907    581587
541908    581587
541909    581587
Name: Invoice, Length: 541910, dtype: object

In [44]:
import re
import numpy as np
def sayilari_bul(metin):
    if pd.isnull(metin):
        return np.nan
    # Sayıları bul
    sayilar = re.findall(r'\d+', metin)
    # Sayıları integer'a çevir ve birleştir
    sayilar = ''.join(sayilar)
    if sayilar: # Eğer sayılar boş değilse integer'a çevir
        return int(sayilar)
    return np.nan

def harfleri_bul(metin):
    if pd.isnull(metin):
        return np.nan
    # Harfleri bul ve birleştir
    harfler = re.findall(r'[a-zA-Z]+', metin)
    harfler = ''.join(harfler)
    return harfler if harfler else np.nan

# Örnek pandas serisi
seri = df["Invoice"].astype(str)

# Sayıları ve harfleri ayrı ayrı bul
sayilar_seri = seri.apply(sayilari_bul)
harfler_seri = seri.apply(harfleri_bul)

# Sonuçları bir DataFrame'de birleştir
a = pd.DataFrame({
    'Sayılar': sayilar_seri,
    'Harfler': harfler_seri
})
a

        Sayılar Harfler
0        536365     NaN
1        536365     NaN
2        536365     NaN
3        536365     NaN
4        536365     NaN
...         ...     ...
541905   581587     NaN
541906   581587     NaN
541907   581587     NaN
541908   581587     NaN
541909   581587     NaN

[541910 rows x 2 columns]

In [47]:
a[a["Harfler"].isin(["C"])]

        Sayılar Harfler
141      536379       C
154      536383       C
235      536391       C
236      536391       C
237      536391       C
...         ...     ...
540449   581490       C
541541   581499       C
541715   581568       C
541716   581569       C
541717   581569       C

[9288 rows x 2 columns]